logrider/benchmarks/results/20260705221857-api-query/raw.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/api-query.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_request_rate: 50.00 iterations/s for 30s (maxVUs: 5-50, gracefulStop: 30s)


running (0m01.0s), 00/05 VUs, 50 complete and 0 interrupted iterations
constant_request_rate   [   3% ] 00/05 VUs  01.0s/30s  50.00 iters/s

running (0m02.0s), 00/05 VUs, 100 complete and 0 interrupted iterations
constant_request_rate   [   7% ] 00/05 VUs  02.0s/30s  50.00 iters/s

running (0m03.0s), 00/05 VUs, 150 complete and 0 interrupted iterations
constant_request_rate   [  10% ] 00/05 VUs  03.0s/30s  50.00 iters/s

running (0m04.0s), 00/05 VUs, 200 complete and 0 interrupted iterations
constant_request_rate   [  13% ] 00/05 VUs  04.0s/30s  50.00 iters/s

running (0m05.0s), 00/05 VUs, 250 complete and 0 interrupted iterations
constant_request_rate   [  17% ] 00/05 VUs  05.0s/30s  50.00 iters/s

running (0m06.0s), 00/05 VUs, 300 complete and 0 interrupted iterations
constant_request_rate   [  20% ] 00/05 VUs  06.0s/30s  50.00 iters/s

running (0m07.0s), 00/05 VUs, 350 complete and 0 interrupted iterations
constant_request_rate   [  23% ] 00/05 VUs  07.0s/30s  50.00 iters/s

running (0m08.0s), 00/05 VUs, 400 complete and 0 interrupted iterations
constant_request_rate   [  27% ] 00/05 VUs  08.0s/30s  50.00 iters/s

running (0m09.0s), 00/05 VUs, 450 complete and 0 interrupted iterations
constant_request_rate   [  30% ] 00/05 VUs  09.0s/30s  50.00 iters/s

running (0m10.0s), 00/05 VUs, 500 complete and 0 interrupted iterations
constant_request_rate   [  33% ] 00/05 VUs  10.0s/30s  50.00 iters/s

running (0m11.0s), 00/05 VUs, 550 complete and 0 interrupted iterations
constant_request_rate   [  37% ] 00/05 VUs  11.0s/30s  50.00 iters/s

running (0m12.0s), 00/05 VUs, 600 complete and 0 interrupted iterations
constant_request_rate   [  40% ] 00/05 VUs  12.0s/30s  50.00 iters/s

running (0m13.0s), 00/05 VUs, 650 complete and 0 interrupted iterations
constant_request_rate   [  43% ] 00/05 VUs  13.0s/30s  50.00 iters/s

running (0m14.0s), 00/05 VUs, 700 complete and 0 interrupted iterations
constant_request_rate   [  47% ] 00/05 VUs  14.0s/30s  50.00 iters/s

running (0m15.0s), 00/05 VUs, 750 complete and 0 interrupted iterations
constant_request_rate   [  50% ] 00/05 VUs  15.0s/30s  50.00 iters/s

running (0m16.0s), 00/05 VUs, 800 complete and 0 interrupted iterations
constant_request_rate   [  53% ] 00/05 VUs  16.0s/30s  50.00 iters/s

running (0m17.0s), 00/05 VUs, 850 complete and 0 interrupted iterations
constant_request_rate   [  57% ] 00/05 VUs  17.0s/30s  50.00 iters/s

running (0m18.0s), 00/05 VUs, 900 complete and 0 interrupted iterations
constant_request_rate   [  60% ] 00/05 VUs  18.0s/30s  50.00 iters/s

running (0m19.0s), 00/05 VUs, 950 complete and 0 interrupted iterations
constant_request_rate   [  63% ] 00/05 VUs  19.0s/30s  50.00 iters/s

running (0m20.0s), 00/05 VUs, 1000 complete and 0 interrupted iterations
constant_request_rate   [  67% ] 00/05 VUs  20.0s/30s  50.00 iters/s

running (0m21.0s), 00/05 VUs, 1050 complete and 0 interrupted iterations
constant_request_rate   [  70% ] 00/05 VUs  21.0s/30s  50.00 iters/s

running (0m22.0s), 00/05 VUs, 1100 complete and 0 interrupted iterations
constant_request_rate   [  73% ] 00/05 VUs  22.0s/30s  50.00 iters/s

running (0m23.0s), 00/05 VUs, 1150 complete and 0 interrupted iterations
constant_request_rate   [  77% ] 00/05 VUs  23.0s/30s  50.00 iters/s

running (0m24.0s), 00/05 VUs, 1200 complete and 0 interrupted iterations
constant_request_rate   [  80% ] 00/05 VUs  24.0s/30s  50.00 iters/s

running (0m25.0s), 00/05 VUs, 1250 complete and 0 interrupted iterations
constant_request_rate   [  83% ] 00/05 VUs  25.0s/30s  50.00 iters/s

running (0m26.0s), 00/05 VUs, 1300 complete and 0 interrupted iterations
constant_request_rate   [  87% ] 00/05 VUs  26.0s/30s  50.00 iters/s

running (0m27.0s), 00/05 VUs, 1350 complete and 0 interrupted iterations
constant_request_rate   [  90% ] 00/05 VUs  27.0s/30s  50.00 iters/s

running (0m28.0s), 00/05 VUs, 1400 complete and 0 interrupted iterations
constant_request_rate   [  93% ] 00/05 VUs  28.0s/30s  50.00 iters/s

running (0m29.0s), 00/05 VUs, 1450 complete and 0 interrupted iterations
constant_request_rate   [  97% ] 00/05 VUs  29.0s/30s  50.00 iters/s

running (0m30.0s), 00/05 VUs, 1500 complete and 0 interrupted iterations
constant_request_rate   [ 100% ] 00/05 VUs  30.0s/30s  50.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 1501    50.024836/s
    checks_succeeded...: 100.00% 1501 out of 1501
    checks_failed......: 0.00%   0 out of 1501

    ✓ status was 200

    HTTP
    http_req_duration..............: avg=4ms    min=2.42ms med=3.84ms max=26.75ms p(90)=4.89ms p(95)=5.16ms
      { expected_response:true }...: avg=4ms    min=2.42ms med=3.84ms max=26.75ms p(90)=4.89ms p(95)=5.16ms
    http_req_failed................: 0.00%  0 out of 1501
    http_reqs......................: 1501   50.024836/s

    EXECUTION
    iteration_duration.............: avg=4.16ms min=2.55ms med=4ms    max=29.14ms p(90)=5.07ms p(95)=5.34ms
    iterations.....................: 1501   50.024836/s
    vus............................: 0      min=0         max=0
    vus_max........................: 5      min=5         max=5

    NETWORK
    data_received..................: 200 kB 6.7 kB/s
    data_sent......................: 267 kB 8.9 kB/s



running (0m30.0s), 00/05 VUs, 1501 complete and 0 interrupted iterations
constant_request_rate ✓ [ 100% ] 00/05 VUs  30s  50.00 iters/s